[
  {
  "tag": "chat",
  "patterns": [
    "Bạn khỏe không?",
    "Chào bạn, bạn làm gì vậy?",
    "Bạn có thể giúp mình không?",
    "Thời tiết hôm nay thế nào?",
    "Bạn tên là gì?",
    "Bạn sinh ra ở đâu?",
    "Bạn thích làm gì?",
    "Tôi đang chán quá",
    "Bạn có thể kể chuyện vui không?",
    "Bạn có thể chơi game không?",
    "Trò chuyện với tôi nhé!",
    "Bạn có biết tôi đang nghĩ gì không?",
    "Bạn có người yêu chưa?",
    "Nói gì đó vui vui đi",
    "Bạn thông minh thật đấy",
    "Tôi vừa ăn xong, bạn thì sao?",
    "Bạn làm được gì?",
    "Có ai ở đó không?",
    "Bạn học ở đâu vậy?",
    "Kể tôi nghe về trí tuệ nhân tạo",
    "Có phim gì hay không bạn?",
    "Bạn có mệt không?",
    "Cảm ơn bạn nhé!",
    "Tạm biệt nhé, hẹn gặp lại!",
    "Bạn nói được mấy thứ tiếng?",
    "Bạn thường hoạt động vào thời gian nào?",
    "Bạn là robot à?",
    "Sở thích của bạn là gì?",
    "Bạn có thể kể chuyện ma không?",
    "Cho mình biết tin tức hôm nay"
  ]
},
  {
  "tag": "simple",
  "patterns": [
    "Nguyên nhân chính gây ra lũ lụt là gì?",
    "Lũ lụt ảnh hưởng thế nào đến nông nghiệp?",
    "Có cách nào để phát hiện lũ sớm không?",
    "Tại sao phải trồng rừng để giảm lũ?",
    "Hệ thống cảnh báo lũ hoạt động như thế nào?",
    "Người dân nên làm gì khi nhận được cảnh báo?",
    "Biện pháp sơ tán khi có thiên tai?",
    "Ảnh hưởng của biến đổi khí hậu đến lũ lụt?",
    "Thiên tai thường xuyên xảy ra ở khu vực nào của Việt Nam?",
    "Làm sao để bảo vệ trẻ em trong mùa lũ?",
    "Cách ứng phó với lũ bất ngờ vào ban đêm?",
    "Vai trò của chính quyền trong phòng chống lũ lụt?",
    "Có những loại lũ nào?",
    "Khác biệt giữa ngập úng và lũ quét là gì?",
    "Khi nào nên gọi là khẩn cấp?",
    "Thiết bị nào dùng để đo mực nước?",
    "Bản đồ nguy cơ lũ có ý nghĩa gì?",
    "Ứng dụng nào có thể cảnh báo lũ?",
    "Chi phí thiệt hại do lũ trung bình mỗi năm?",
    "Tại sao mưa liên tục lại gây sạt lở đất?",
    "Làm thế nào để cứu người bị lũ cuốn?",
    "Lũ lụt ảnh hưởng gì đến chất lượng nước?",
    "Chính phủ hỗ trợ người dân sau lũ ra sao?",
    "Nên mang theo gì khi sơ tán?",
    "Có nên dùng thuyền cao su khi lũ không?",
    "Lũ xảy ra nhanh hay chậm?",
    "Mưa lớn bao nhiêu mm thì nguy hiểm?",
    "Thời gian báo trước của hệ thống cảnh báo là bao lâu?",
    "Dữ liệu cảm biến nào giúp phát hiện sớm lũ?",
    "Tác động lâu dài của lũ đến môi trường là gì?"
  ]
},
  {
    "tag": "call",
    "patterns": [
      "Gửi cảnh báo tới người dân",
      "Gửi email thông báo ngập lụt",
      "Tôi muốn báo lũ",
      "Thông báo khẩn cấp về tình trạng ngập",
      "Gửi tin nhắn cảnh báo thiên tai",
      "Báo cho người dân gần sông về nguy cơ lũ",
      "Gửi thư khẩn đến chính quyền",
      "Tôi muốn gửi thông tin lũ tới người khác",
      "Thông báo tình trạng nguy hiểm",
      "Kích hoạt hệ thống cảnh báo tự động",
      "Cảnh báo mưa lớn bất thường",
      "Báo động cho khu vực dân cư",
      "Gửi dữ liệu lũ lên hệ thống trung tâm",
      "Tôi cần gửi thông điệp cảnh báo"
    ]
  }
]
